using System;

namespace TAM_Task_04
{
    class Program
    {
     
        static Random rnd = new Random();
        static int fire = 65;
        static int ice = rnd.Next(50, 71);
        static int regen = 20;
        static int iceStun = 0;
        static int swordShot = rnd.Next(15, 21);
        static int inspectum = 2;
        static string buffer = "";
        static int damage = 0;
        static int bonus = 1;
        static int limitStun = 0;
        static int limitRegen = 0;
       
        static string passWord;

        static int health = 100;
        static int dogHealth = 75;
        static int dwarfHealth = 110;
        static int octoctopusHealth = 200;
        static int ogreHealth = 250;
        static int demonHealth = 400;

        static int kojot;
        static int dward;
        static int octopus;
        static int ogre;
        static int boss;

        static int i = 0;
        static int j = 0;

        static void Fight(ref int helth, int D)
        {
            string a;
            Console.WriteLine("Введите заклинание");

            a = Console.ReadLine();

            if (bonus >= 2) bonus--;
            if (a == "fire")
            {
                helth -= fire * bonus;
            } // FIRE
            else if (a == "ice")
            {
                helth -= ice * bonus;
            } // ICE
            else if (a == "iceStun")
            {
                if (limitStun == 0)
                {
                    if (buffer == "ice")
                    {
                        damage = 2;
                    }

                    limitStun = 3;
                }
                else
                {
                    Console.WriteLine("Это заклинание сейчас недоступно");
                    Console.ReadKey();
                }

            } // ICE STUN
            else if (a == "inspectum")
            {
                bonus = 3;
            } // INSPECTUM
            else if (a == "swordShot")
            {
                helth -= swordShot * bonus;
            }
            else if (a == "regen")
            {
                if (limitRegen == 0)
                {
                    health += 20;

                    limitRegen = 3;
                }
                else
                {
                    Console.WriteLine("Это заклинание сейчас недоступно");
                    Console.ReadKey();
                }

            }

            if (damage == 0)
            {
                health -= D;
            }

            buffer = a;
            if (damage > 0) damage -= 1;
            if (limitStun > 0) limitStun--;
            if (limitRegen > 0) limitRegen--;

        }

        static void Main(string[] args)
        {

            // ОТКРЫВАЙТЕ КОНСОЛЬНОЕ ОКНО ПРИ ЗАПУСКЕ В ПОЛНОЭКРАННОМ РЕЖИМЕ!!!!!!!!!!! (ДЛЯ ПОЛНОТЫ ИЗОБРАЖЕНИЯ И РАЦИОНАЛЬНОГО РАСПОЛОЖЕНИЯ ТАБУЛЯЦИЙ


        

            Console.WriteLine(@"
                   __  __                 _                             _____                                                 
                  |  \/  |               | |                           |  __ \                                                
                  | \  / |  _   _   ___  | |_    ___   _ __   _   _    | |  | |  _   _   _ __     __ _    ___    ___    _ __  
                  | |\/| | | | | | / __| | __|  / _ \ | '__| | | | |   | |  | | | | | | | '_ \   / _` |  / _ \  / _ \  | '_ \ 
                  | |  | | | |_| | \__ \ | |_  |  __/ | |    | |_| |   | |__| | | |_| | | | | | | (_| | |  __/ | (_) | | | | |
                  |_|  |_|  \__, | |___/  \__|  \___| |_|     \__, |   |_____/   \__,_| |_| |_|  \__, |  \___|  \___/  |_| |_|
                             __/ |                             __/ |                              __/ |                       
                            |___/                             |___/                              |___/                        
            ");

            Console.WriteLine("===============================================================================================================================");
            Console.WriteLine("Вы рыцарь-маг, знаменитый своими выдающимися навыками в магии, священным мечом 'Виток', а также чудовищами, которых победели.");
            Console.WriteLine("В вашем арсенале есть целых 6 заклинаний, сложных в изучении и очень полезных в применении!");
            Console.WriteLine("Вы начинаете свое новое путешествие по враждебным землям и на пути к вашей цели, вам встречаются монстры.");
            Console.WriteLine("Одолейте всех врагов и достигните своей цели!!!");

            Console.WriteLine("===============================================================================================================================");

            Console.WriteLine("Первое заклинание: Инспектум - определяет слабое место врага, позволяя наносить двойной урон по нему остальными заклинаниями.");
            Console.WriteLine("\nВторое заклинание: Фарголум - пылающий огненный шар, который вы можете отправить прямиком во врага, нанося ему 65 урона.");
            Console.WriteLine("\n\nТретье заклинание: Лекосмус - обледенелая стрела, яростно летящая во врага, может нанести ему от 50 до 71 урона, в зависимости от вашей удачи, конечно!");
            Console.WriteLine("\nЧетвертое заклинание: Стеколмус - замораживает врага, из-за чего тот будет вынужден пропустить 1 ход. Действует только в том случае, если вы на прошлом ходу применили 'Лекосмус'.");
            Console.WriteLine("\nПятое заклинание: Выстрел из священного меча - атакует врага светом, озарившем меч, нанося ему 15-21 урона.");
            Console.WriteLine("\nШестое заклинание: Реакто - восстанавливает вам 25 очков здоровья.");
            Console.WriteLine("===============================================================================================================================");

            do
            {
                
                Console.WriteLine("Для начала вашего путешествия, введите 'start'.");
                Console.WriteLine("===============================================================================================================================");
                passWord = Convert.ToString(Console.ReadLine());
                Console.WriteLine("===============================================================================================================================");


            }
            while (passWord != "start"); // НАЧАЛО ПУТЕШЕСТВИЯ

            Console.Clear();

            Console.WriteLine("===============================================================================================================================");
            Console.WriteLine("Вы выходите из города 'Штормград' и направляетесь в сторону леса...");
            Console.WriteLine("Ваша задача: Дойти до локации 'Башня Медива' и спасти её от терании демона.");
            Console.WriteLine("До башни Медива вам нужно пересечь 4 иных локации, а именно: 'Лес Штормграда', 'Угодье Фермеров', 'Речной город', 'Равнинная местность'.");
            Console.WriteLine("После прохождения каждой локации вам будет полностью восстановлены очки здоровья, а также начислена награда, в зависимости от конечного здоровья на локации.");
            Console.WriteLine("===============================================================================================================================");
            
            Console.WriteLine($@"

                              ▐█▌                            ██
                              ▐█▌                            ██
                            ┌▄▐▀▌▄▄                          ██
                            ▐█▌▐█▌    ▄▄▄▄▄▄▄▄▄▄▄▄        ▄▄╢▀¼▄⌐
                            ▐█▌▐██▄▄▄▄████▀▀▀▀▀▀▀▀▄▄▄▄    ██▌∩██b
                            ▐█╙▀▀████▓▓▓▓▓▓▓▓▓▓║║▀▀▀▀▓▄  ██▌∩██b
                            ▐█▌▐▀▀██▓▓▓▓▓▓▓▓▓▓║║║║║║▀▀▓▓▀▀Γ∩██b
                             └▐█▌▒████▓▓▓▓▓▓║║║║║║║║██▒▒▓█▌└
                              ▐███▌████▓▓▓▓║║║║║║║║║║████╩`
                              ▐██████████▓▓██████████████████═
                              ▐███████▓▓▓▓▓██████████████¬
                              ▐██████▓▓▓▓▓▓║║║║║╠████║║║║██─
                                ▐██████▓▓▓▓▓▓▓▓║╠████▓▓▓▓██▄
                             ...▐████████▓▓▓▓▓▓║▒████▓▓▓▓██████▄.
                          .,▐██████████████████████████████▒▒║║██▌,
                        ╓▄╣██▀▒║╢▀▓▓███████████████████████▓▓▒▒▒▒██▌                                       === РЫЦАРЬ-МАГ
                        ║██▓▒║║▒▒▒▒▓█████▓▓▓▓║╠▀▀▀▀▀▀║║██████████▀▀=                                       === ЗДОРОВЬЕ - {health}
                        ╙▀██▓▒▓▓▓████████▓▓▓▓▒▒║║║║║║║║████████▀▀"");                                      === МОЛОД И КРАСИВ
                  ╗▄▄▄▄▄▄▄███████████████▓▓▓▓▓▓▓▓║║║║║║████████M
                  ███▀▀▀▀▀▀▀▀▀▀▀▀▀███████▓▓▓▓▓▓▓▓▓▓║║▓▓█████████▄p
                  ██▓▓Ñ╠∩∩∩∩∩∩▐╠╠╠▐████████▓▓▓▓▓▓▓▓▓▓████▓▓██████▓▓▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀
                  ███▓▒▒▒▒M∩∩∩││││▐████████████████████████████▓▓▒▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▓▓
                  ███▓▒▒▒▒▒▒M∩∩∩∩∩▐████████████████████▓▓▒█████▓▓M---------------------------██
                  ████▓▓▒▒▒▒M∩▐║║║▐██▓▓▒█████████████▒▒████████▓▓▒________________________║██
                  ████▓▓▒▒▒▒▒▒▒▓▌╠▐████▓▓║║║║██▓▓║║║║▓▓██¬ ██████▌╠╠╠╠╠╠╠╠╠╠╠╠╠╠╠║██
                    ████▓▓▓▓▒▒▒▓██▌ j████████  ████████    ███████████████████████
                      ╫██▒▒▒▒▒██▌   ▐██▒║║║██  ██▓▓║║║║██  ██████b
                        ╚█████▌   ▐██▓▓▓▓▒▒██  ██▓▓▓▓▒▒██
                                  ╘▀▀██████▀▀  ██████████
                                   ▄▄███▀▀█▄▄  ███████▀▀█▄▄
                                  ▐████▒▒▒▒██  ▀▀████▒▒▒▒██¬
            "); // ПЕРСОНАЖ
            do
            {
                Console.WriteLine("===============================================================================================================================");
                Console.WriteLine("Чтобы пройти в лес, напишите 'Go to the forest'.");
                Console.WriteLine("===============================================================================================================================");

                passWord = Convert.ToString(Console.ReadLine());
                

            }
            while (passWord != "Go to the forest"); // ЦИКЛ ПЕРЕХОДА В ЛЕС

            do
            {


                Console.Clear();

                Console.Write("Вы натыкаетесь на опасного обитателя лесов, Койота! \t");
                Console.WriteLine(@"
                   ============================================================================================================ 
                    fire              === наносит 65 ед. урона
                    ice               === наносит 50 - 71 ед. урона
                    regen             === восстанавливает 20 ед. здоровья
                    iceStun           === iceStun полезный только после использования ice, противник пропускает 2 хода
                    swordShot         === наносит 15 - 21 ед. урона
                    inspectum         === увеличивает наносимый урон следующего заклинания в 2 раза      
                   ============================================================================================================ 

                "); // ТАБЛИЦА ЗАКЛИНАНИЙ

                Console.Write("HP игрока: ");
                for (i = 0; i < (health / 10); i++)
                {
                    Console.Write('█');
                }

                if (health < 100)
                {
                    for (i = 0; i < 10 - (health / 10); i++)
                    {
                        Console.Write('_');
                    }
                }

                    Console.Write($"\t {health} ");
                    Console.WriteLine($@"

    
                    ▓▓p        ▓████▓                                                             
                   █████     ████████                                                           
                   ██▀██╪▄   ██º▀▀▒██╪⌐                                                         
                   ██  ╙███  █▌ ██▀███▌                                                         
                   ██╠Ç.██████É.███▌É███                                                        
                   ██╠▓█▀▀▀M╠╠▀███▓█████                                                        
                     █▌▀╠╠╠╠╠███████████                                                        
                     █▌╠╠╠╠╣▒╠▀██████▒Ñ╠█▌                                                          === КОЙОТ
                     ████▌╠███████████▌╠██▓                                                         === ЗДОРОВЬЕ - {dogHealth}
                     █████▓███▓█████████@▒█▄                                                        === ВРАГ
                  ╪███████████████████████████▌╪╪╪╪╪╪╪╪╪                                        
                 j██████████████████████████████▀▀▀▀▀▀▀▀████████████████                        
                   ▀▀▀▀▀▀▌   █████████████████▌ÉÑÑ▄███████▀▀╠...███⌐ .██▀▀▀██.                  
                             ███████████████████████▓███▀▀ █████████▓███▓ê ╙▀██▓                
                              ███████████████████████████▌ ██████████████████████▌              
                              ███████████▌   ▒█████████▀█████████████████████ └╠█████▄⌐         
                              ██████████▀▌&▓▓█████████▌╠█▀███████████████████ └╠███████▓        
                                ████████   ██████████████████████████████████░┤▄█▌   ████▌      
                                  ▀█████╪#º█▀███████████████████████████▀▀███╠██ j█⌐ ▀████▀▌╪╪╪╪
                                   .╙██████╪╠▀████████████████████████▌╙  ▀██╠██  ╙██ ██╙. .╙╙██ 
                                      ╝▀▀███▀╠▒██████▀▀▀▀▀▀   ██████████  ▒BÉ███     ▀▀▀.....▀▌ 
                                      ╒▓▓█▀╕≈╠██████▀         └▀████████▓███████▓▓▓     ▀▀▀▀▀   
                                     █▌ ▀▀█▓████                 ╜███████████████████            
                                ▄╣█▀▀▄█████▀▀▀▌▄                   ██████═  ▐▀█████▄⌐          
                                █▌  ███▀▀▀██╠██                  ████▌▀      ██████▌          
                                ██@██      ██ ▀█                  ██ÑÑÑ█▌       ▐████▌  
                              ┌╪█████      ▀▀╪⌐ █▌             ╪██▌╠██▀          ▀██ ██       
                              ███████        █▌ ╙▀█            █████╙              ██ ██      
                             ████▀        ...██ j█⌐           ▀████             ██▒██        
                              └▀▀▀         █████▓██⌐            ▀▀▀            ▓███████         
                                           ██████▌                               █████
                "); // КОЙОТ - 1 враг

                Fight(ref dogHealth, 15);

            } while ((dogHealth > 0) && (health > 0)); // КАЙОТ
            if (health <= 0)
            {
                Console.Clear();
                Console.WriteLine("Вы проиграли эту битву! Начните сначала!");
                Console.ReadKey();
                Environment.Exit(0);
            } // ПРОИГРЫШ
            do
            {

                Console.WriteLine("===============================================================================================================================");
                Console.WriteLine("Чтобы перейти в угодье фермеров напишите 'Go to the farm'.");
                Console.WriteLine("===============================================================================================================================");

                passWord = Convert.ToString(Console.ReadLine());

            } while (passWord != "Go to the farm"); // ЦИКЛ ПЕРЕХОДА НА ФЕРМУ        
            health = 100;

            do
            {


                Console.Clear();

                Console.WriteLine("Вы встречаете озлобленного дфорфа с огромным молотом, который явно вам не рад.");
                Console.WriteLine(@"
                   ============================================================================================================ 
                    fire              === наносит 65 ед. урона
                    ice               === наносит 50 - 71 ед. урона
                    regen             === восстанавливает 20 ед. здоровья
                    iceStun           === iceStun полезный только после использования ice, противник пропускает 2 хода
                    swordShot         === наносит 15 - 21 ед. урона
                    inspectum         === увеличивает наносимый урон следующего заклинания в 2 раза      
                   ============================================================================================================ 

                "); // ТАБЛИЦА ЗАКЛИНАНИЙ

                Console.Write("HP игрока: ");
                for (i = 0; i < (health / 10); i++)
                {
                    Console.Write('█');
                }

                if (health < 100)
                {
                    for (i = 0; i < 10 - (health / 10); i++)
                    {
                        Console.Write('_');
                    }
                }

                Console.Write($"\t {health} ");
                Console.WriteLine($@"

                            ███████████████
                           ██████████████████            ██████████                             
                         ▄████▓▓▒█▌▌▒║▒████▒▓▄        .╢██████╠██████
                         ██████▓▒██▒▒▒▒▒███▓██b     ╓█████╙║║┘│║║████K¿                         
                         █████▒▓▒███▓▒▒║███▒██▌╖▄▄#▓M∩⌠║▒██▒ `║N██ÑÑ▒██▓╗▄,                    
                         ███████████▓███████████▒▒██∩#▄▓▀╙╙║░#╜╙╙▒▒▒▓▓████▒██▒██▄                
                         ▀███████████████████║████████▒∩╔░║█▓▒║▒╫▒▒███████▒████▄               === ОЗЛОБЛЕННЫЙ ДВОРФ
                               └▀███▓▒▒▒▒█╙▄å████████▓▒▒╫▓▒█████▒║▒█████▒███▒▒▒▒▓              === ЗДОРОВЬЕ - {dwarfHealth}
                               .█████▒▒▒██▓▒▒╠██████████▓▒║╢║N║▒╢║███████████▒▒▒▒▒▓█           === ВРАГ
                               ║██▓██▒▒▒███▓▒▒║║▒█████████▒▓▓▒▓▒▒████████▓▒▒║▒▓▒█▒▒▒█▄         
                                ██▓███████▒███▓▓████████████▒▒▒███████████▒▓███▒█▓▓▒▓▓           
                                ╙███▒▒║██▓█████████████████████████████████▒▓▒███▓▒█▒▒▓▄         
                                  ║██▒▒▓▒███▒█████████████████████████████████▓████████▌         
                                  █  █▒███████▀█ ██████████████▒██▓██▒█████████████████▀         
                                     █▒▓ ▌.╙    ██████████▓█████████▒▒███████████████▀└          
                                     └██ ▀     ██████████████████████████████████▀▀▀▌            
                                      ██b      ▐██████████████████████████████╙║  ▐              
                                      ▐██   ▄#█▓██████████████████████████████▄   ║              
                                      └██   ███████████████████████████████████▌                 
                                       ██b  ║██████████████████████████████████                  
                                       ███  ║████████████▌╙███████████████████▀                  
                                       ███ ╓████████████▀        ▀▀███████████▄,                 
                                     , ████████████████▌╓╓▄M╓»╓╓▄▐█████████████   ▓. .#         
                                    ╓▓▒██████████████████████████████████████████████▓▓▓K        
                                    └╙╙▀███████████████████████████▀████████████▀╙╙╙╙╙└`         
                     "); // ДВОРФ - 2 враг

                Fight(ref dwarfHealth, 20);

            } while ((dwarfHealth > 0) && (health > 0)); // ДВОРФ
            if (health <= 0)
            {
                Console.Clear();
                Console.WriteLine("Вы проиграли эту битву! Начните сначала!");
                Console.ReadKey();
                Environment.Exit(0);
            } // ПРОИГРЫШ
            do
            {

                Console.WriteLine("===============================================================================================================================");
                Console.WriteLine("Чтобы перейти в речной город напишите 'Go to the rivercity'.");
                Console.WriteLine("===============================================================================================================================");

                passWord = Convert.ToString(Console.ReadLine());

            } while (passWord != "Go to the rivercity"); // ЦИКЛ ПЕРЕХОДА В РЕЧНОЙ ГОРОД
            health = 100;

            do
            {


                Console.Clear();

                Console.Write("HP игрока: ");
                for (i = 0; i < (health / 10); i++)
                {
                    Console.Write('█');
                }

                if (health < 100)
                {
                    for (i = 0; i < 10 - (health / 10); i++)
                    {
                        Console.Write('_');
                    }
                }

                Console.Write($"\t {health} ");
                Console.WriteLine("Вы подходите к воротам речного городка, вам радушно машет ближайший стражник!");
                Console.WriteLine("Но как этого желают боги, из воды на переходный мост выползает синий осьминог, здешний огромный монстр!");

                Console.WriteLine(@"
                   ============================================================================================================ 
                    fire              === наносит 65 ед. урона
                    ice               === наносит 50 - 71 ед. урона
                    regen             === восстанавливает 20 ед. здоровья
                    iceStun           === iceStun полезный только после использования ice, противник пропускает 2 хода
                    swordShot         === наносит 15 - 21 ед. урона
                    inspectum         === увеличивает наносимый урон следующего заклинания в 2 раза      
                   ============================================================================================================ 

                "); // ТАБЛИЦА ЗАКЛИНАНИЙ

                Console.WriteLine($@"

                                                             ████████████████████▌ 

                                                             ▓▓▓▓▓ÑÑÑÑÑÑÑÑÑÑ▒▒█▓▓██▌                 
                                                        ▓▓▓##▀▀ÑÑ║ÑÑÑÑÑÑÑ║║║Ñ▒╠▀▀███▓▓▓▓▌            
                                                     ╒▄▄██▌▒▒║║╠╠╠│││││║║║║║║║║║║▒▒╠▀▀███▄▄          
                                                   ▄▄╪██▒▒▒╠╠║║ÑNNNNNNN║║║║║║║║║║║║║║║▒▒║██▄▄▄       
                                                   ███▒▒║║╠NN║║║║║║║║║║▒▒▒║║║║║║║▒▒▒▒▒║║║▒▒██▌       
                                                 ..██▌║║║║║║║║║║║║║║║║║▒▒▒║║║║║║║▒▒▒▒▒║║║▒▒██▌..
                                                ▐██▒▒▒║║║║║║║║║║║║║║║║║║║║║║║║║║║▒▒▒▒▒║║║▒▒█████       === СИНИЙ ОСЬМИНОГ
                                                ▐█████▒▒║║║║║║║║▒▒█████▒▒▒║║║║║║║║║║║║││▐▒▒▒▒║██       === ВРАГ
                                                ▐██ÑÑ║██║║║║║▒▒███ÑÑÑÑÑ██▌║║║║║║║││ÑÑÑ▒▒▒▒▒▒▒║████▌    === ЗДОРОВЬЕ - {octoctopusHealth}
                                                ▐██╢╢║██║║║║║███▀▀║║╢╢╢██▌║║▒▒▒ÑÑ▒▓▓▓▓▒▒▒▒▒▒▒║████▌    === НЕВОСПРИИМЧИМ К ОРУЖИЮ БЛИЖНЕГО БОЯ
                                              ▄▄█▀▀█████║║║║║███▒▒▒▒▒║║██▌╠╠▒▒▓▒▒███▒▒▒▒▒▒▒▒▒║████▌  
                               ▄▄▄▄▄          ██▌▒▒▀▀▀▀▀║║║║║████████████▌▒▒██▒▒▒█████▒▒▒▒▒███████▌  
                            ╓▄▄█████▄▄,       ▀▀█▒▒░▄║▒▄║║║║║▒▒▀██▀▀▀▀▀▒▒║▒▒███▒▒█████▒▒▒▒▒█████▀▀▀  
                          ..║█████████▌..       ▐██▒▒███║▒QQQ▒▒│▒▒▄▄▄▄▄▒▒███▒▒██████████████████     
                          ███████b    ▐██       ▐███████▒▒███▒▒║██████████▒▒███████████████          
                          █████                    █████████████████████████████████████▌            
                       ║███████                      ▐█████████████████████████▒▒███║║██▌            
                       ║███████                    ▓▓█████████████▒▒█████████████▒▒▌ÑÑ▀▀█▓▓          
                       ║███████╗╗b            ▓▓▓▓▓████████████████████████████████▌║║║║║██          
                       ║█████▒▒██▌▄▄▄▄▄▄▄▄▄▄▄▄███▀▀▒▒▒▒▒████████▒▒████████▒▒███████▌▒▒▒▒▒▒▒▄▄▄       
                       ╙▀▀███▒▒▒▒█████████▀▀▀▀▒▒▒▒▒▄▄▄▄▄██████▀█▒▒▒▒██████▒▒▒▒║█████▒▒▒▒▒║║██▌       
                          █████▒▒▒▒▒▒▒▒▒▒QQ▄▄▄▒▒█████████████▒▒║▒▒██████████▒▒║▒▒█████▒▒▒║║██▌       
                            ║█████▒▒▒▒█████████████║║Ñ││║║║▒▒▒▒║████████████▒▒▒║║▒▒║██▒▒▌││▒▒░       
                                 ║███████▒▒▒▒▒║║Ñ││║║║▒▒▒▒║████████████     ██▌║║▒▒║██▒▒▌││║║▐██     
                               ████████▒▒▒▒▒▒▒▒▒▒▒▒█████████████████▌       ███▒▒▒▒║██▒▒▒║║║║▐██     
                          ▓▓▓▓▓█████▒▒▒▒▒█████████████████████████..        .-▐██▒▒║██▒▒▒║║▒▒║██     
                       ╔▓▓█████████████████▌╙╙╙╙╙╙╙████████████▌╙     ▓▓m    ▐██▒▒║██▒▒▒▒▒▒▒║██     
                       ║███████████████▀▀▀▀    ╒▄▄████████╙╙╙╙      ██▌▄▄  ▐██▒▒║██▒▒▒▒▒███▀▀     
                       ║████▀▀▀█████▀▀─         ▐███████▀▀       ▄▄  █████▄▄▐███▒███▒▒▒▒▒██▌       
                       ║████b  █████          ,,▐█████▀▀       .,,██▌  ███████████████▒║║▒▒██▌       
                       ║████b    ║██          ███████▌         ▐██       ▐█████████▌││║║║▒▒██▌       
                          ██b       ██▌       ███████▌         ▐████▌       ███████▌║║▒▒║██          
                            ║██               █████            ▐███████████████▒▒▒▒▒▒▒█████          
                                              ..▐██▓▓Γ          ..██████║▒▒▒▒▒▒▒▒███████▌..          
                                                 ╙╙╙╙             ╙╙╙╙██████████╙╙╙╙╙╙╙   
                     "); // СИНИЙ ОСЬМИНОГ - 3 враг


                Fight(ref octoctopusHealth, 25);

            } while ((octoctopusHealth > 0) && (health > 0)); // ОСЬМИНОГ
            if (octoctopusHealth <= 0)
            {
                do
                {
                    Console.WriteLine("===============================================================================================================================");
                    Console.WriteLine("Чтобы перейти на равнинную местность, напишите 'Go to the plains'.");
                    Console.WriteLine("===============================================================================================================================");

                    passWord = Convert.ToString(Console.ReadLine());

                }
                while (passWord != "Go to the plains"); // ЦИКЛ ПЕРЕХОДА НА РАВНИНЫ
               
            } // пабеда
            else
            {
                Console.Clear();
                Console.WriteLine("Вы проиграли эту битву! Начните сначала!");
                Console.ReadKey();
                Environment.Exit(0);
            }
            health = 100;

            do
            {

                Console.Clear();

                Console.WriteLine("Покинув речной город, вы направляетесь далее по своему пути, на равнины.");
                Console.WriteLine("Пересекая один холм за другим, в далеке вы замечаете повозку, из которой яростно вырывается пламя.");
                Console.WriteLine("Подбежав поближе вы обнаруживаете двухголового огра, пожирающего остатки людей...");

                Console.WriteLine(@"
                   ============================================================================================================ 
                    fire              === наносит 65 ед. урона
                    ice               === наносит 50 - 71 ед. урона
                    regen             === восстанавливает 20 ед. здоровья
                    iceStun           === iceStun полезный только после использования ice, противник пропускает 2 хода
                    swordShot         === наносит 15 - 21 ед. урона
                    inspectum         === увеличивает наносимый урон следующего заклинания в 2 раза      
                   ============================================================================================================ 

                "); // ТАБЛИЦА ЗАКЛИНАНИЙ

                Console.Write("HP игрока: ");
                for (i = 0; i < (health / 10); i++)
                {
                    Console.Write('█');
                }

                if (health < 100)
                {
                    for (i = 0; i < 10 - (health / 10); i++)
                    {
                        Console.Write('_');
                    }
                }

                Console.Write($"\t {health} ");                      

                Console.WriteLine($@"

                 






                                    ___         ___
                                       |         |
                                       L ████████|              __       __                            
                                     █████████████              |        |
                                     ███ 0████ 0███             L████████|
                                     ████████████             ███████████████
                                     ████1____1███            ███ 0████ 0███
                                      ███████████             ██████████████              === ДВУХГОЛОВЫЙ ОГР
                                       ██████                  ███1_____1████             === ВРАГ
                                     █████████████████        ███████████████             === ЗДОРОВЬЕ - {ogreHealth}
                        m╗██████████████████████▌██████████████████▒█▌╠███▒▒█████         === НЕВОСПРИИМЧИМ К ОГНЮ
                        ║▒▒▒▒▒▒▄▐▒████▒▓████████████████████████████▒██▒████████▀▀        
                      ╔███▓▓▒▓██▓▒████▒▓████████████████████████████▓██████▓██▀     
                      ║███████████████▒▓██████▒▒███████████████████████████████▓       
                      ╙▀▀█████████████▒▓██████████████████████████████████████▀            
                           ╙╙╙████████████▒▒█████████▒█████████▒▒█████████▌               
                                ╙▀██████████████▒█████████████████████████b               
                                 ▐████████████████████████████████████████b             
                                ▄▓███████▌ ╙████████████████████Ö ▌███████▓▄                 
                                ▀▒║███████   ║████████████▒████⌐  ▀████████▀                 
                                ▐████████   j██████████████████▄   ████████             
                                ▐████████   j███████████▓▓▓▓▓▓▓▓M. ████████                
                                ▐████████  ▄██████████████████████▒╓███████                  
                                ╒▓██████╗ ╗███████████████▓▓██████ ██▒▒▒▒█                 
                                ▐██▒█████⌐████████████▒███████████⌐████████                
                            ██████████████████████████████████▒████████████                
                            ╙╙╙╙╙▀████████████████╩ ╙╙╙███████████████████              
                                        ▀█████████¬ ╓▒▒▒███████████▀                     
                                         ██████████▓███████████████m                 
                                         ▀███████¬  ▀███████████▀                        
                                          ▀██████─     ╙▀██████▀                         
                                           ██▓▓▓▓█       █▓▓▓▓█                          
                                         ,╓▓██████     j██████▓,,                          
                                       ▄▓█████████     j█████████▓▄    
                     "); // ДВУХГОЛОВЫЙ ОГР - 4 враг

                Fight(ref ogreHealth, 30);

            } while ((ogreHealth > 0) && (health > 0)); // ОГР
            if (ogreHealth <= 0)
            {
                do
                {
                    
                    Console.WriteLine("===============================================================================================================================");
                    Console.WriteLine("Чтобы зайти в башню, напишите 'Go to the tower'.");
                    Console.WriteLine("===============================================================================================================================");

                    passWord = Convert.ToString(Console.ReadLine());


                } while (passWord != "Go to the tower"); // ЦИКЛ ПЕРЕХОДА В БАШНЮ
            }
            else
            {
                Console.Clear();
                Console.WriteLine("Вы проиграли эту битву! Начните сначала!");
                Console.ReadKey();
                Environment.Exit(0);
            } // ПРОИГРЫШ
            health = 100;

            do
            {

                Console.Clear();

                Console.WriteLine("Одолев огра-людоеда, вы отправляетесь прямиком в башню.");
                Console.WriteLine("Вы замечаете, что вся почва вокруг башни гниет, деревья вянут, а животные и вовсе лежат мертвые.");
                Console.WriteLine("Заметив странное фиолетовое свечение на самой вершине башни, вы молниеносно направляетесь туда.\n");
                Console.WriteLine(@"Поднявшись на вершину башни, вы видите то, как крылатый демон высасывает жизнь из придворного мага Медива,
                     а магия этого демона настолько страшна, что все вокруг, казалось, принимает фиолетовый оттенок. \t");

                Console.WriteLine(@"
                   ============================================================================================================ 
                    fire              === наносит 65 ед. урона
                    ice               === наносит 50 - 71 ед. урона
                    regen             === восстанавливает 20 ед. здоровья
                    iceStun           === iceStun полезный только после использования ice, противник пропускает 2 хода
                    swordShot         === наносит 15 - 21 ед. урона
                    inspectum         === увеличивает наносимый урон следующего заклинания в 2 раза      
                   ============================================================================================================ 

                "); // ТАБЛИЦА ЗАКЛИНАНИЙ

                Console.Write("HP игрока: ");
                for (i = 0; i < (health / 10); i++)
                {
                    Console.Write('█');
                }

                if (health < 100)
                {
                    for (i = 0; i < 10 - (health / 10); i++)
                    {
                        Console.Write('_');
                    }
                }

                Console.Write($"\t {health} ");
                Console.WriteLine($@"

                       «.    ▄▄▄▄▄▄▄▄▄▄▄▄█▌   ▄▄▄▄▄▄▄   ▐█▄▄▄▄▄▄▄▄▄▄▄▄    .»              
                          ▓▓█████████████▌  ▄  █████  ▄  ║█████████████▓▓█             
                           ▀█▄█▓█║╝▌╙████▌ ║▌ ▐▄ 0 ▄▌ ╙▌ └████▌▐▌██▌█▓█▀                  
                            ╙█▀▀██#█¢█ ▐█▄▓█║  █▄.▄█ ▌▀▓▄█▌ █▌╫▓██▀██∩                   
                                          █▀█▓▀▀███▀██▀█ ▀▌                       === КРЫЛАТЫЙ ДЕМОН
                                ╓        ▀▓▓█▓▄║█╓▓█▓▓▀▌                          === ЗДОРОВЬЕ - {demonHealth}
                                ╙█▄▄▄▄████▓█▀ ▀████▀ ▀▓█████▄▄▄▄█▌                === ВРАГ
                                  ║ ▐█ ▐▀     ██████     ▀▌▐█ ║                   === У НЕГО НЕТ СЛАБЫХ МЕСТ
                                  ║ ▐█ ▐   ▄▄▄██████▄▄▄   ▌▐█ ║                         
                                  ║ ▐█ ▐    ▐████████     ▌▐█ ║                    
                                  ║ ▐█ ▐     ║███████     ▌▐█ ║                  
                                  ║ ▐█ ▐     ▐██████▌     ▌▐█ ║                         
                                  ║ ▐█ ▐      ██████      ▌▐█ ║                        
                                  ║ ▐█ ▐       ████       ▌▐█ ║                           
                                  ║ ▐█ ▐       ████       ▌▐█ ║                        
                                              ██████                                     
                                              ▐████▌                                     
                                            ▄▓██████▓▄                                   
                                        ██████████████████
                                       ▐ █    ▄▄▄▄▄▄    █ ▌                            
                                       ▐▄▄    █:  :█    ▄▄▌
                                            ▐▀      ▀▌                                  
                                            ▐ ▄▄▄▄▄▄ ▌                                                                                                              

                      "); // КРЫЛАТЫЙ ДЕМОН - ФИНАЛЬНЫЙ БОСС

                Fight(ref demonHealth, 20);

            } while ((demonHealth > 0) && (health > 0)); // ФИНАЛЬНЫЙ БОСС
            if (demonHealth <= 0)
            {         
                
                    Console.WriteLine("===============================================================================================================================");
                    Console.WriteLine("Вы одержали победу над финальным боссом и теперь сможете вернуться на свою землю!");
                    Console.WriteLine("===============================================================================================================================");
                    Console.ReadKey();
                    Environment.Exit(0);

            }
            else 
            {
                Console.Clear();
                Console.WriteLine("Вы проиграли эту битву! Начните сначала!");
                Console.ReadKey();
                Environment.Exit(0);
            } // ПРОИГРЫШ

        }
    }
}
